# Conductor Material Properties

Source: https://www.revitapidocs.com/2026/8d96b0a6-69de-2e41-20d1-358af54c8abf.htm

---

| Conductor Material Properties |
| --- |

The ConductorMaterial type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | Id | The Conductor Material id. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The Conductor Material name. |

Top See Also

#### Reference

ConductorMaterial Class Autodesk.Revit.DB.Electrical Namespace